# HemisphericalLightDistribution Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HemisphericalLightDistribution Members
HemisphericalLightDistribution Class Constructors Methods Properties See Also
---
The HemisphericalLightDistribution type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HemisphericalLightDistribution()()()() | Creates a hemispherical light distribution object. |
| HemisphericalLightDistribution(HemisphericalLightDistribution) | Creates a copy of the given hemispherical light distribution |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Creates a copy of the LightDistribution derived object.  (Inherited from LightDistribution.) |
| Dispose | (Inherited from LightDistribution.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from LightDistribution.) |

# See Also
HemisphericalLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace